app/Controllers/ClienteController.php

    public function listado() {
        $modelo = new ClienteModel();
        $datos['clientes'] = $modelo->findAll();
---
SELECT *
FROM `clientes`

    public function editar($id) {
        $modelo = new ClienteModel();
        $datos['cliente'] = $modelo->find($id);
---
SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '8'