app/Controllers/DispositivoController.php

    public function obtenerClientes() {
        $clienteModel = new ClienteModel();
        $clientes = $clienteModel->findAll();
---
SELECT *
FROM `clientes`